Ryan-Rogers/MMSoftware/MM_2015.X/support/pic24f/h/p24FJ128GA308.h
#define _LCDDATA19_S50C4_POSITION                0x00000002
#define _LCDDATA19_S50C4_MASK                    0x00000004
#define _LCDDATA19_S50C4_LENGTH                  0x00000001

#define _LCDDATA20_S00C5_POSITION                0x00000000
#define _LCDDATA20_S00C5_MASK                    0x00000001
#define _LCDDATA20_S00C5_LENGTH                  0x00000001

#define _LCDDATA20_S01C5_POSITION                0x00000001
#define _LCDDATA20_S01C5_MASK                    0x00000002
#define _LCDDATA20_S01C5_LENGTH                  0x00000001

#define _LCDDATA20_S02C5_POSITION                0x00000002
#define _LCDDATA20_S02C5_MASK                    0x00000004
#define _LCDDATA20_S02C5_LENGTH                  0x00000001

#define _LCDDATA20_S03C5_POSITION                0x00000003
#define _LCDDATA20_S03C5_MASK                    0x00000008
#define _LCDDATA20_S03C5_LENGTH                  0x00000001

#define _LCDDATA20_S04C5_POSITION                0x00000004
#define _LCDDATA20_S04C5_MASK                    0x00000010
#define _LCDDATA20_S04C5_LENGTH                  0x00000001

#define _LCDDATA20_S05C5_POSITION                0x00000005
#define _LCDDATA20_S05C5_MASK                    0x00000020
#define _LCDDATA20_S05C5_LENGTH                  0x00000001

#define _LCDDATA20_S06C5_POSITION                0x00000006
#define _LCDDATA20_S06C5_MASK                    0x00000040
#define _LCDDATA20_S06C5_LENGTH                  0x00000001

#define _LCDDATA20_S07C5_POSITION                0x00000007
#define _LCDDATA20_S07C5_MASK                    0x00000080
#define _LCDDATA20_S07C5_LENGTH                  0x00000001

#define _LCDDATA20_S08C5_POSITION                0x00000008
#define _LCDDATA20_S08C5_MASK                    0x00000100
#define _LCDDATA20_S08C5_LENGTH                  0x00000001

#define _LCDDATA20_S09C5_POSITION                0x00000009
#define _LCDDATA20_S09C5_MASK                    0x00000200
#define _LCDDATA20_S09C5_LENGTH                  0x00000001

#define _LCDDATA20_S10C5_POSITION                0x0000000A
#define _LCDDATA20_S10C5_MASK                    0x00000400
#define _LCDDATA20_S10C5_LENGTH                  0x00000001

#define _LCDDATA20_S11C5_POSITION                0x0000000B
#define _LCDDATA20_S11C5_MASK                    0x00000800
#define _LCDDATA20_S11C5_LENGTH                  0x00000001

#define _LCDDATA20_S12C5_POSITION                0x0000000C
#define _LCDDATA20_S12C5_MASK                    0x00001000
#define _LCDDATA20_S12C5_LENGTH                  0x00000001

#define _LCDDATA20_S13C5_POSITION                0x0000000D
#define _LCDDATA20_S13C5_MASK                    0x00002000
#define _LCDDATA20_S13C5_LENGTH                  0x00000001

#define _LCDDATA20_S14C5_POSITION                0x0000000E
#define _LCDDATA20_S14C5_MASK                    0x00004000
#define _LCDDATA20_S14C5_LENGTH                  0x00000001

#define _LCDDATA20_S15C5_POSITION                0x0000000F
#define _LCDDATA20_S15C5_MASK                    0x00008000
#define _LCDDATA20_S15C5_LENGTH                  0x00000001

#define _LCDDATA21_S16C5_POSITION                0x00000000
#define _LCDDATA21_S16C5_MASK                    0x00000001
#define _LCDDATA21_S16C5_LENGTH                  0x00000001

#define _LCDDATA21_S17C5_POSITION                0x00000001
#define _LCDDATA21_S17C5_MASK                    0x00000002
#define _LCDDATA21_S17C5_LENGTH                  0x00000001

#define _LCDDATA21_S18C5_POSITION                0x00000002
#define _LCDDATA21_S18C5_MASK                    0x00000004
#define _LCDDATA21_S18C5_LENGTH                  0x00000001

#define _LCDDATA21_S19C5_POSITION                0x00000003
#define _LCDDATA21_S19C5_MASK                    0x00000008
#define _LCDDATA21_S19C5_LENGTH                  0x00000001

#define _LCDDATA21_S20C5_POSITION                0x00000004
#define _LCDDATA21_S20C5_MASK                    0x00000010
#define _LCDDATA21_S20C5_LENGTH                  0x00000001

#define _LCDDATA21_S21C5_POSITION                0x00000005
#define _LCDDATA21_S21C5_MASK                    0x00000020
#define _LCDDATA21_S21C5_LENGTH                  0x00000001

#define _LCDDATA21_S22C5_POSITION                0x00000006
#define _LCDDATA21_S22C5_MASK                    0x00000040
#define _LCDDATA21_S22C5_LENGTH                  0x00000001

#define _LCDDATA21_S23C5_POSITION                0x00000007
#define _LCDDATA21_S23C5_MASK                    0x00000080
#define _LCDDATA21_S23C5_LENGTH                  0x00000001

#define _LCDDATA21_S24C5_POSITION                0x00000008
#define _LCDDATA21_S24C5_MASK                    0x00000100
#define _LCDDATA21_S24C5_LENGTH                  0x00000001

#define _LCDDATA21_S25C5_POSITION                0x00000009
#define _LCDDATA21_S25C5_MASK                    0x00000200
#define _LCDDATA21_S25C5_LENGTH                  0x00000001

#define _LCDDATA21_S26C5_POSITION                0x0000000A
#define _LCDDATA21_S26C5_MASK                    0x00000400
#define _LCDDATA21_S26C5_LENGTH                  0x00000001

#define _LCDDATA21_S27C5_POSITION                0x0000000B
#define _LCDDATA21_S27C5_MASK                    0x00000800
#define _LCDDATA21_S27C5_LENGTH                  0x00000001

#define _LCDDATA21_S28C5_POSITION                0x0000000C
#define _LCDDATA21_S28C5_MASK                    0x00001000
#define _LCDDATA21_S28C5_LENGTH                  0x00000001

#define _LCDDATA21_S29C5_POSITION                0x0000000D
#define _LCDDATA21_S29C5_MASK                    0x00002000
#define _LCDDATA21_S29C5_LENGTH                  0x00000001

#define _LCDDATA21_S30C5_POSITION                0x0000000E
#define _LCDDATA21_S30C5_MASK                    0x00004000
#define _LCDDATA21_S30C5_LENGTH                  0x00000001

#define _LCDDATA21_S31C5_POSITION                0x0000000F
#define _LCDDATA21_S31C5_MASK                    0x00008000
#define _LCDDATA21_S31C5_LENGTH                  0x00000001

#define _LCDDATA22_S32C5_POSITION                0x00000000
#define _LCDDATA22_S32C5_MASK                    0x00000001
#define _LCDDATA22_S32C5_LENGTH                  0x00000001

#define _LCDDATA22_S33C5_POSITION                0x00000001
#define _LCDDATA22_S33C5_MASK                    0x00000002
#define _LCDDATA22_S33C5_LENGTH                  0x00000001

