Ryan-Rogers/MMSoftware/MM_2015.X/support/pic24f/h/p24FJ128GA308.h
#define _LCDDATA22_S34C5_POSITION                0x00000002
#define _LCDDATA22_S34C5_MASK                    0x00000004
#define _LCDDATA22_S34C5_LENGTH                  0x00000001

#define _LCDDATA22_S35C5_POSITION                0x00000003
#define _LCDDATA22_S35C5_MASK                    0x00000008
#define _LCDDATA22_S35C5_LENGTH                  0x00000001

#define _LCDDATA22_S36C5_POSITION                0x00000004
#define _LCDDATA22_S36C5_MASK                    0x00000010
#define _LCDDATA22_S36C5_LENGTH                  0x00000001

#define _LCDDATA22_S37C5_POSITION                0x00000005
#define _LCDDATA22_S37C5_MASK                    0x00000020
#define _LCDDATA22_S37C5_LENGTH                  0x00000001

#define _LCDDATA22_S38C5_POSITION                0x00000006
#define _LCDDATA22_S38C5_MASK                    0x00000040
#define _LCDDATA22_S38C5_LENGTH                  0x00000001

#define _LCDDATA22_S39C5_POSITION                0x00000007
#define _LCDDATA22_S39C5_MASK                    0x00000080
#define _LCDDATA22_S39C5_LENGTH                  0x00000001

#define _LCDDATA22_S40C5_POSITION                0x00000008
#define _LCDDATA22_S40C5_MASK                    0x00000100
#define _LCDDATA22_S40C5_LENGTH                  0x00000001

#define _LCDDATA22_S41C5_POSITION                0x00000009
#define _LCDDATA22_S41C5_MASK                    0x00000200
#define _LCDDATA22_S41C5_LENGTH                  0x00000001

#define _LCDDATA22_S42C5_POSITION                0x0000000A
#define _LCDDATA22_S42C5_MASK                    0x00000400
#define _LCDDATA22_S42C5_LENGTH                  0x00000001

#define _LCDDATA22_S43C5_POSITION                0x0000000B
#define _LCDDATA22_S43C5_MASK                    0x00000800
#define _LCDDATA22_S43C5_LENGTH                  0x00000001

#define _LCDDATA22_S44C5_POSITION                0x0000000C
#define _LCDDATA22_S44C5_MASK                    0x00001000
#define _LCDDATA22_S44C5_LENGTH                  0x00000001

#define _LCDDATA22_S45C5_POSITION                0x0000000D
#define _LCDDATA22_S45C5_MASK                    0x00002000
#define _LCDDATA22_S45C5_LENGTH                  0x00000001

#define _LCDDATA22_S46C5_POSITION                0x0000000E
#define _LCDDATA22_S46C5_MASK                    0x00004000
#define _LCDDATA22_S46C5_LENGTH                  0x00000001

#define _LCDDATA22_S47C5_POSITION                0x0000000F
#define _LCDDATA22_S47C5_MASK                    0x00008000
#define _LCDDATA22_S47C5_LENGTH                  0x00000001

#define _LCDDATA23_S48C5_POSITION                0x00000000
#define _LCDDATA23_S48C5_MASK                    0x00000001
#define _LCDDATA23_S48C5_LENGTH                  0x00000001

#define _LCDDATA23_S50C5_POSITION                0x00000002
#define _LCDDATA23_S50C5_MASK                    0x00000004
#define _LCDDATA23_S50C5_LENGTH                  0x00000001

#define _LCDDATA24_S00C6_POSITION                0x00000000
#define _LCDDATA24_S00C6_MASK                    0x00000001
#define _LCDDATA24_S00C6_LENGTH                  0x00000001

#define _LCDDATA24_S01C6_POSITION                0x00000001
#define _LCDDATA24_S01C6_MASK                    0x00000002
#define _LCDDATA24_S01C6_LENGTH                  0x00000001

#define _LCDDATA24_S02C6_POSITION                0x00000002
#define _LCDDATA24_S02C6_MASK                    0x00000004
#define _LCDDATA24_S02C6_LENGTH                  0x00000001

#define _LCDDATA24_S03C6_POSITION                0x00000003
#define _LCDDATA24_S03C6_MASK                    0x00000008
#define _LCDDATA24_S03C6_LENGTH                  0x00000001

#define _LCDDATA24_S04C6_POSITION                0x00000004
#define _LCDDATA24_S04C6_MASK                    0x00000010
#define _LCDDATA24_S04C6_LENGTH                  0x00000001

#define _LCDDATA24_S05C6_POSITION                0x00000005
#define _LCDDATA24_S05C6_MASK                    0x00000020
#define _LCDDATA24_S05C6_LENGTH                  0x00000001

#define _LCDDATA24_S06C6_POSITION                0x00000006
#define _LCDDATA24_S06C6_MASK                    0x00000040
#define _LCDDATA24_S06C6_LENGTH                  0x00000001

#define _LCDDATA24_S07C6_POSITION                0x00000007
#define _LCDDATA24_S07C6_MASK                    0x00000080
#define _LCDDATA24_S07C6_LENGTH                  0x00000001

#define _LCDDATA24_S08C6_POSITION                0x00000008
#define _LCDDATA24_S08C6_MASK                    0x00000100
#define _LCDDATA24_S08C6_LENGTH                  0x00000001

#define _LCDDATA24_S09C6_POSITION                0x00000009
#define _LCDDATA24_S09C6_MASK                    0x00000200
#define _LCDDATA24_S09C6_LENGTH                  0x00000001

#define _LCDDATA24_S10C6_POSITION                0x0000000A
#define _LCDDATA24_S10C6_MASK                    0x00000400
#define _LCDDATA24_S10C6_LENGTH                  0x00000001

#define _LCDDATA24_S11C6_POSITION                0x0000000B
#define _LCDDATA24_S11C6_MASK                    0x00000800
#define _LCDDATA24_S11C6_LENGTH                  0x00000001

#define _LCDDATA24_S12C6_POSITION                0x0000000C
#define _LCDDATA24_S12C6_MASK                    0x00001000
#define _LCDDATA24_S12C6_LENGTH                  0x00000001

#define _LCDDATA24_S13C6_POSITION                0x0000000D
#define _LCDDATA24_S13C6_MASK                    0x00002000
#define _LCDDATA24_S13C6_LENGTH                  0x00000001

#define _LCDDATA24_S14C6_POSITION                0x0000000E
#define _LCDDATA24_S14C6_MASK                    0x00004000
#define _LCDDATA24_S14C6_LENGTH                  0x00000001

#define _LCDDATA24_S15C6_POSITION                0x0000000F
#define _LCDDATA24_S15C6_MASK                    0x00008000
#define _LCDDATA24_S15C6_LENGTH                  0x00000001

#define _LCDDATA25_S16C6_POSITION                0x00000000
#define _LCDDATA25_S16C6_MASK                    0x00000001
#define _LCDDATA25_S16C6_LENGTH                  0x00000001

#define _LCDDATA25_S17C6_POSITION                0x00000001
#define _LCDDATA25_S17C6_MASK                    0x00000002
#define _LCDDATA25_S17C6_LENGTH                  0x00000001

#define _LCDDATA25_S18C6_POSITION                0x00000002
#define _LCDDATA25_S18C6_MASK                    0x00000004
#define _LCDDATA25_S18C6_LENGTH                  0x00000001

#define _LCDDATA25_S19C6_POSITION                0x00000003
#define _LCDDATA25_S19C6_MASK                    0x00000008
#define _LCDDATA25_S19C6_LENGTH                  0x00000001

#define _LCDDATA25_S20C6_POSITION                0x00000004
#define _LCDDATA25_S20C6_MASK                    0x00000010
#define _LCDDATA25_S20C6_LENGTH                  0x00000001

#define _LCDDATA25_S21C6_POSITION                0x00000005
#define _LCDDATA25_S21C6_MASK                    0x00000020
#define _LCDDATA25_S21C6_LENGTH                  0x00000001

